---
type: SymbolicCurve
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# SymbolicCurve

`Autodesk.Revit.DB.SymbolicCurve` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | IsDrawnInForeground | — | `public bool IsDrawnInForeground { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ReferenceType | — | `public ReferenceType ReferenceType { get ; set ; }` |
| Property | Subcategory | — | `public GraphicsStyle Subcategory { get ; set ; }` |